Repository: oandregal/poss-gl
Catalog: tmx/ch03.tmx
Source language: en
Languages: gl

source: Most issue databases eventually suffer from the same problem: a crushing load of duplicate or invalid issues filed by well-meaning but inexperienced or ill-informed users. The first step in combatting this trend is usually to put a prominent notice on the front page of the bug tracker, explaining how to tell if a bug is really a bug, how to search to see if it's already been filed, and finally, how to effectively report it if one still thinks it's a new bug.
gl: As máis das bases de datos de asuntos sofren de cando en vez o mesmo problema: unha cantidade crítica de asuntos duplicados ou inválidos procedentes de usuarios ben intencionados mais inexpertos ou mal informados. O primeiro paso para combater esta tendencia consiste en colgar un aviso ben visible na páxina de entrada ao xestor de erros no que se explique como saber se un erro é realmente un erro, como buscar se xa foi notificado e, finalmente, como facer correctamente a notificación se se segue a pensar que se trata realmente dun erro novo.

source: This will reduce the noise level for a while, but as the number of users increases, the problem will eventually come back. No individual user can be blamed for it. Each one is just trying to contribute to the project's well-being, and even if their first bug report isn't helpful, you still want to encourage them to stay involved and file better issues in the future. In the meantime, though, the project needs to keep the issue database as free of junk as possible.
gl: Ese sistema reduciría o nivel de ruído por un tempo, mais segundo aumenta o número de usuarios, o problema vai retornar. Ningún usuario individual pode ser culpado diso. Cada un deles está pretendendo contribuír ao benestar do proxecto, e mesmo se a primeira notificación do erro non é útil, deberás continuar animándoos a permaneceren involucrados e a que fagan mellores contribucións no futuro. Mentres tanto, porén, o proxecto vai precisar manter a base de datos de asuntos o máis libre de lixo posible.

source: The two things that will do the most to prevent this problem are: making sure there are people watching the bug tracker who have enough knowledge to close issues as invalid or duplicates the moment they come in, and requiring (or strongly encouraging) users to confirm their bugs with other people before filing them in the tracker.
gl: As dúas cousas que mellor van contribuír a previr este problema son: estar seguro de que vai haber xente suficientemente capacitada controlando o que está a ocorrer no sistema de xestión de erros como para ser quen de pechar notificacións inválidas ou duplicadas no momento xusto en que entran, e requirir (ou recomendar fortemente) que os usuarios confirmen con outros usuarios os erros detectados por eles antes de reportalos ao sistema.

source: The first technique seems to be used universally. Even projects with huge issue databases (say, the Debian bug tracker at <ulink url="http://bugs.debian.org/"></ulink>, which contained 315,929 issues as of this writing) still arrange things so that <emphasis>someone</emphasis> sees each issue that comes in. It may be a different person depending on the category of the issue. For example, the Debian project is a collection of software packages, so Debian automatically routes each issue to the appropriate package maintainers. Of course, users can sometimes misidentify an issue's category, with the result that the issue is sent to the wrong person initially, who may then have to reroute it. However, the important thing is that the burden is still shared&mdash;whether the user guesses right or wrong when filing, issue watching is still distributed more or less evenly among the developers, so each issue is able to receive a timely response.
gl: Semella que a primeira das técnicas mencionadas está a ser usada universalmente. Mesmo proxectos con bases de datos inmensas (nomeadamente, o xestor de erros de Debian en <ulink url="http://bugs.debian.org/"></ulink>, que no momento de escribir este texto contiña 315.929 asuntos <footnote><para>N. do T.: máis de 500.000 no momento de facer esta tradución</para></footnote> aínda organizan as cousas de xeito que <emphasis>alguén</emphasis> ve os asuntos que van chegando ao sistema. Pode ser unha persoa diferente para cada categoría de asuntos. Por exemplo, o proxecto Debian é unha colección de pacotes de software, así que Debian encamiña automaticamente cada novo asunto aos mantedores do correspondente pacote. Por suposto, os usuarios poden ás veces trabucarse na identificación das categorías ás que corresponden os erros detectados, co resultado de que o erro é enviado inicialmente á persoa incorrecta, quen deberá encargarse de encamiñalo novamente. De calquera maneira, o importante é que a carga de traballo é compartida, de todos modos&mdash;se o usuario tiver dúbidas no momento de reportar un asunto, a vixilancia sobre a entrada de asuntos vai estar mellor ou peor distribuída entre os desenvolvedores, de xeito que cada asunto vai recibir sempre unha resposta a tempo.

source: The second technique is less widespread, probably because it's harder to automate. The essential idea is that every new issue gets "buddied" into the database. When a user thinks he's found a problem, he is asked to describe it on one of the mailing lists, or in an IRC channel, and get confirmation from someone that it is indeed a bug. Bringing in that second pair of eyes early can prevent a lot of spurious reports. Sometimes the second party is able to identify that the behavior is not a bug, or is fixed in recent releases. Or she may be familiar with the symptoms from a previous issue, and can prevent a duplicate filing by pointing the user to the older issue. Often it's enough just to ask the user "Did you search the bug tracker to see if it's already been reported?" Many people simply don't think of that, yet are happy to do the search once they know someone's <emphasis>expecting</emphasis> them to.
gl: A segunda técnica está menos estendida, probablemente porque é máis difícil de automatizar. A idea esencial é que cada asunto novo é "coleguizado" na base de datos. Cando un usuario pensa que localizou un problema, solicítaselle que o describa nunha lista de correo, ou nun canal IRC, e recibe a confirmación por parte de alguén que lle di que efectivamente é un erro. Dispoñer cedo deste segundo par de ollos pode previr unha chea de reportes falsos. Ás veces, o segundo implicado é quen de identificar que o comportamento reportado non é un erro, ou que xa está corrixido nalgunha versión recente. Ou pode estar familiarizado cos síntomas dun asunto anterior, e evitar unha segunda incorporación do erro dirixindo o usuario cara ao asunto orixinal. Frecuentemente abonda con preguntarlle ao usuario: "Pesquisaches no sistema de xestión de erros se xa foi comunicado?". Moita xente simplemente nin pensa nesa posibilidade, aínda que farán a pesquisa de bo grado se saben que alguén <emphasis>espera</emphasis> que a fagan.

source: The buddy system can really keep the issue database clean, but it has some disadvantages too. Many people will file solo anyway, either through not seeing, or through disregarding, the instructions to find a buddy for new issues. Thus it is still necessary for volunteers to watch the issue database. Furthermore, because most new reporters don't understand how difficult the task of maintaining the issue database is, it's not fair to chide them too harshly for ignoring the guidelines. Thus the volunteers must be vigilant, and yet exercise restraint in how they bounce unbuddied issues back to their reporters. The goal is to train each reporter to use the buddying system in the future, so that there is an ever-growing pool of people who understand the issue-filtering system. On seeing an unbuddied issue, the ideal steps are:
gl: O sistema de colegas pode manter a base de datos de asuntos realmente limpa, mais tamén ten algunhas desvantaxes. Moita xente vai reportar en solitario, de todas maneiras, ben por non teren atopado, ou por ignoraren deliberadamente, as instrucións sobre pesquisa dun colega para reportar asuntos novos. Así que aínda vai ser necesario que haxa voluntarios revisando a base de datos. Aínda máis, como os máis dos remitentes novos non van ser conscientes da dificultade de manter a base de datos de asuntos, non é axeitado reprendelos por teren ignorado as instrucións. Así que os voluntarios van ter que permanecer atentos, e controlar como lles van devolver os asuntos non "colegueados" aos seus remitentes. O obxectivo é adestrar cada remitente no uso do sistema de colegas, de tal xeito que haxa sempre unha reserva crecente de xente que entende o sistema de filtraxe. Cando se detecta un asunto non revisado por un colega, os pasos ideais son:

source: Immediately respond to the issue, politely thanking the user for filing, but pointing them to the buddying guidelines (which should, of course, be prominently posted on the web site).
gl: Responder inmediatamente ao asunto, agradecendo amablemente o usuario por telo remitido, mais dirixíndoos as instrucións sobre revisión por terceiros (que, por suposto, deberán estar ben visibles na web do proxecto).

source: If the issue is clearly valid and not a duplicate, approve it anyway, and start it down the normal life cycle. After all, the reporter's now been informed about buddying, so there's no point wasting the work done so far by closing a valid issue.
gl: Se o asunto for claramente válido e non estiver duplicado, aprobádeo de todas maneiras, e iniciade o seu ciclo de vida normal. Despois de todo, o remitente xa estará informado sobre o sistema de revisión, e non ten sentido perder o tempo e o traballo feito pola vía de pechar un asunto perfectamente válido.

source: Otherwise, if the issue is not clearly valid, close it, but ask the reporter to reopen it if they get confirmation from a buddy. When they do, they should put a reference to the confirmation thread (e.g., a URL into the mailing list archives).
gl: Pola contra, se o asunto non for claramente válido, péchao, mais pídelle ao remitente que o reabra se recibir confirmación dun colega. Cando a recibiren, deberán facer mención ao fío de confirmación (p.e.: mediante unha URL dos arquivos da lista).

source: Remember that although this system will improve the signal/noise ratio in the issue database over time, it will never completely stop the misfilings. The only way to prevent misfilings entirely is to close off the bug tracker to everyone but developers&mdash;a cure that is almost always worse than the disease. It's better to accept that cleaning out invalid issues will always be part of the project's routine maintenance, and to try to get as many people as possible to help.
gl: Lembra que aínda que este sistema vai mellorar co tempo a relación sinal/ruído na base de datos, non vai poder evitar completamente a introdución de asuntos incorrectos. A única maneira de previr totalmente este problema é pechar o xestor de erros para todo o mundo salvo para os desenvolvedores&mdash;un remedio que é case sempre peor que a enfermidade. É mellor aceptar que a limpeza de asuntos inválidos vai constituír sempre unha tarefa máis da rutina de mantemento do proxecto, e tratar de contar co máximo número de persoas botando unha man.

source: See also <xref linkend="issue-manager"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase>.
gl: Podes ver máis sobre este tema en <xref linkend="xestor-de-asuntos"/><phrase output="printed"> en <xref linkend="xestionando-voluntarios"/></phrase>.

source: IRC / Real-Time Chat Systems
gl: IRC / Sistema de comunicacións en tempo real

source: Many projects offer real-time chat rooms using <firstterm>Internet Relay Chat</firstterm> (<firstterm>IRC</firstterm>), forums where users and developers can ask each other questions and get instant responses. While you <emphasis>can</emphasis> run an IRC server from your own web site, it is generally not worth the hassle. Instead, do what everyone else does: run your IRC channels at Freenode (<ulink url="http://freenode.net/"></ulink>). Freenode gives you the control you need to administer your project's IRC channels,<footnote><para>There is no requirement or expectation that you donate to Freenode, but if you or your project can afford it, please consider a contribution. They are a tax-exempt charity in the U.S., and they perform a valuable service.</para></footnote> while sparing you the not-insignificant trouble of maintaining an IRC server yourself.
gl: Moitos proxectos ofrecen salas de conversación en tempo real usando foros <firstterm>Internet Relay Chat</firstterm>(<firstterm>IRC</firstterm>) nos que usuario e desenvolvedores poden responder ás preguntas dos demais e obter respostas instantáneas. Aínda que <emphasis>poidas</emphasis> manter un servidor IRC na túa propia sede web, normalmente non paga a pena facelo. Pola contra, fai o que fai todo o mundo: establece os teus canais IRC en Freenode(<ulink url="http://freenode.net/"></ulink>). Freenode ofréceche o control que precisas para administrar os canais IRC do teu proxecto, <footnote><para>Non hai obriga nin se espera que fagas unha doazón a Freenode, mais se ti ou o teu proxecto podedes afrontalo, por favor, pensa en contribuír economicamente. están exentos de impostos nos EEUU, e están a fornecer un servizo realmente valioso.</para></footnote>

source: The first thing to do is choose a channel name. The most obvious choice is the name of your project&mdash;if that's available at Freenode, then use it. If not, try to choose something as close to your project's name, and as easy to remember, as possible. Advertise the channel's availabity from your project's web site, so a visitor with a quick question will see it right away. For example, this appears in a prominently placed box at the top of Subversion's home page:
gl: A primeira tarefa é a de buscar un nome para o canal. A elección máis obvia é a do nome do teu proxecto&mdash;se estiver dispoñible en Freenode, úsao. Se non , tenta dar con algo que se lle pareza o máis posible, e que sexa o máis doado de lembrar. Anuncia a dispoñibilidade do canal na páxina do proxecto, de xeito que un visitante que teña necesidade de facer unha pregunta urxente o atope á primeira. Por exemplo, esta mensaxe aparece nunha caixa moi ben situada na páxina de Subversion:

source: <blockquote> <para><emphasis>If you're using Subversion, we recommend that you join the</emphasis> <literal>users@subversion.tigris.org</literal> <emphasis>mailing list, and read the <ulink url="http://svnbook.red-bean.com/">Subversion Book</ulink> and <ulink url="http://subversion.tigris.org/faq.html">FAQ</ulink>. You can also ask questions on IRC at</emphasis> <literal>irc.freenode.net</literal> <emphasis>channel</emphasis>&nbsp;<literal>#svn</literal>.</para> </blockquote> <para>Some projects have multiple channels, one per subtopic. For example, one channel for installation problems, another for usage questions, another for development chat, etc. (<xref linkend="growth"/><phrase output="printed"> in <xref linkend="communications"/></phrase> discusses and how to divide into multiple channels). When your project is young, there should only be one channel, with everyone talking together. Later, as the user-to-developer ratio increases, separate channels may become necessary.</para> <para>How will people know all the available channels, let alone which channel to talk in? And when they talk, how will they know what the local conventions are?</para> <para>The answer is to tell them by setting the <firstterm>channel topic</firstterm>.<footnote><para>To set a channel topic, use the <literal>/topic</literal> command. All commands in IRC start with "<literal>/</literal>". See <ulink url="http://www.irchelp.org/"></ulink> if you're not familiar with IRC usage and administration; in particular, <ulink url="http://www.irchelp.org/irchelp/irctutorial.html"></ulink> is an excellent tutorial.</para></footnote> The channel topic is a brief message each user sees when they first enter the channel. It gives quick guidance to newcomers, and pointers to further information. For example:</para> <screen> You are now talking on #svn Topic for #svn is Forum for Subversion user questions, see also http://subversion.tigris.org/. || Development discussion happens in #svn-dev. || Please don't paste long transcripts here, instead use a pastebin site like http://pastebin.ca/. || NEWS: Subversion 1.1.0 is released, see http://svn110.notlong.com/ for details. </screen> <para>That's terse, but it tells newcomers what they need to know. It says exactly what the channel is for, gives the project home page (in case someone wanders into the channel without having first been to the project web site), mentions a related channel, and gives some guidance about pasting.</para> <sidebar id="paste-sites"> <title>Paste Sites</title> <para>An IRC channel is a shared space: everyone can see what everyone else is saying. Normally, this is a good thing, as it allows people to jump into a conversation when they think they have something to contribute, and allows spectators to learn by watching. But it becomes problematic when someone has to provide a large quantity of information at once, such as a debugging session transcript, because pasting too many lines of output into the channel will disrupt other conversations.</para> <para>The solution is to use one of the <firstterm>pastebin</firstterm> or <firstterm>pastebot</firstterm> sites. When requesting a large amount of data from someone, ask them not to paste it into the channel, but instead to go to (for example) <ulink url="http://pastebin.ca/"></ulink>, paste their data into the form there, and tell the resulting new URL to the IRC channel. Anyone can then visit the URL and view the data.</para> <para>There are a number of free paste sites available now, too many for a comprehensive list, but here are some of the ones I've seen used: <ulink url="http://www.nomorepasting.com/"></ulink>, <ulink url="http://pastebin.ca/"></ulink>, <ulink url="http://nopaste.php.cd/"></ulink> <ulink url="http://rafb.net/paste/"></ulink> <ulink url="http://sourcepost.sytes.net/"></ulink>, <ulink url="http://extraball.sunsite.dk/notepad.php"></ulink>, and <ulink url="http://www.pastebin.com/"></ulink>.</para> </sidebar>
gl: <blockquote> <para><emphasis>Se estás a empregar Subversion, recomendámosche que te unas á lista</emphasis> <literal>users@subversion.tigris.org</literal> <emphasis>, e que leas o <ulink url="http://svnbook.red-bean.com/">Subversion Book</ulink> e as <ulink url="http://subversion.tigris.org/faq.html">FAQ</ulink>. Podes tamén facer preguntas no IRC en </emphasis> <literal>irc.freenode.net</literal> <emphasis>canal</emphasis>&nbsp;<literal>#svn</literal>.</para> </blockquote> <para>Algúns proxectos ofrecen varios canais, un por subtema. Por exemplo, un canal para problemas de instalación, outro para cuestións sobre o uso, outro para conversas sobre desenvolvemento, etc. (<xref linkend="growth"/><phrase output="printed"> en <xref linkend="comunicacións"/></phrase> trata sobre como subdividir en múltiples canais). Mentres o teu proxecto sexa novo, debería haber un só canal, con todo o mundo charlando nel. Máis tarde, cando o ratio usuario-desenvolvedor crece, a separación de canáis pode volverse necesaria.</para> <para>Como vai saber a xente cales son os canais dispoñibles, e en que canal charlar? E cando falen nun canal, como van saber cales son as regras locais?</para> <para>A resposta está en dicirllo pola vía de establecer o <firstterm>tema do canal</firstterm>.<footnote><para>Para facelo, usa o comando <literal>/topic</literal>. Todos os comandos no IRC comezan polo carácter "<literal>/</literal>". Bótalle unha ollada a <ulink url="http://www.irchelp.org/"></ulink> se non estás familiarizado co uso e administración do IRC; en particular, <ulink url="http://www.irchelp.org/irchelp/irctutorial.html"></ulink> é un excelente tutorial.</para></footnote> O tema do canal é unha mensaxe breve que cada usuario ve no momento de entrar no canal. Inclúe instrucións para os novatos e ligazóns a máis información. Por exemplo:</para> <screen> Estás charlando en #svn O tema para #svn é o Foro para as cuestións dos usuarios de Subversion, podes visitar tamén http://subversion.tigris.org/. || As discusións sobre desenvolvemento teñen lugar en #svn-dev. || Por favor non coles transcricións longas aquí, pola contra usa un sitio como http://pastebin.ca/. || NOVAS: Subversion 1.1.0 foi liberado, máis detalles en ttp://svn110.notlong.com/. </screen> <para>Xa sei que é pesado, mais infórmalles aos novatos sobre todo o que precisan saber. Di exactamente para que é o canal, facilita o enderezo da páxina do proxecto (para o caso de que alguén se pasee polo canal sen ter visitado antes o sitio web do proxecto), menciona un canal relacionado e dá algúns consellos sobre pegar textos.</para> <sidebar id="sitios-de-pegado"> <title>Sitios de pegado</title> <para>Un canal IRC é un espazo compartido: todo o mundo pode ver o que calquera outro está a escribir. Normalmente isto é bo, xa que permite que a xente se meta nunha conversa cando cre que ten algo co que contribuír, e permite que os observadores aprendan mirando. Mais empeza a ser un problema cando alguén ten unha chea de información que compartir dunha vez, tal como a transcrición dunha sesión de corrección de erros, xa que pegar demasiadas liñas no canal vai entorpecer outras conversas.</para> <para>A solución está en usar un dos sitios <firstterm>pastebin</firstterm> ou <firstterm>pastebot</firstterm>. Cando se precise que alguén aporte uha cantidade grande de datos, non lle pidas que os pegue no chat, senón que vaia (por exemplo) a <ulink url="http://pastebin.ca/"></ulink>, pegue os seus datos no formulario da páxina, e comunique a URL resultante no canal. Calquera poderá visitar a URL e ver os datos. </para> <para> Hai uns cantos sitios gratuítos para pegado de datos na web, demasiados para unha lista entendible, mais estes son alguns dos que eu teño usado: <ulink url="http://www.nomorepasting.com/"></ulink>, <ulink url="http://pastebin.ca/"></ulink>, <ulink url="http://nopaste.php.cd/"></ulink> <ulink url="http://rafb.net/paste/"></ulink> <ulink url="http://sourcepost.sytes.net/"></ulink>, <ulink url="http://extraball.sunsite.dk/notepad.php"></ulink>, e <ulink url="http://www.pastebin.com/"></ulink>.</para> </sidebar>

source: Many technically-oriented IRC channels have a non-human member, a so-called <firstterm>bot</firstterm>, that is capable of storing and regurgitating information in response to specific commands. Typically, the bot is addressed just like any other member of the channel, that is, the commands are delivered by "speaking to" the bot. For example:
gl: Moitos canais IRC orientados a asuntos técnicos inclúen un membro non humano, chamado <firstterm>bot</firstterm>, que é quen de almacenar e devolver información en resposta a certos comandos. Tipicamente, a comunicación co bot faise de xeito exactamente igual que con calquera outro membro do canal, é dicir, os comandos se executan pola vía de "dicirllo" ao bot. Por exemplo:

source: &lt;kfogel&gt; ayita: learn diff-cmd = http://subversion.tigris.org/faq.html#diff-cmd &lt;ayita&gt; Thanks!
gl: &lt;kfogel&gt; ayita: learn diff-cmd = http://subversion.tigris.org/faq.html#diff-cmd &lt;ayita&gt; Grazas!
